
#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
ТекДанные = Элементы.Товары.ТекущиеДанные;
ТекстСообщения = "Изменено количество";



ПересчитатьСумму(ТекДанные, ТекстСообщения);
	
КонецПроцедуры



&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
    ТекстСообщения = "Изменена цена";
    ПересчитатьСумму(ТекДанные, ТекстСообщения)
    
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчитать сумму.
// 
// Параметры:
//  СтрокаТЧ - ДанныеФормыЭлементКоллекции - Строка табличной части которая будет пересчитана
//  ТекстСообщения - Строка - Текст сообщения для отображения пользователю
&НаКлиенте
Процедура ПересчитатьСумму(СтрокаТЧ, Знач ТекстСообщения)
	
	
	
	Перем Сообщение;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (ТекстСообщения);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти